Repository: pexip/os-ssl-cert
Catalog: debian/po/*.po
Languages: fr

source: Host name:
fr: Nom d'hôte :

source: Please enter the host name to use in the SSL certificate.
fr: Veuillez indiquer le nom d'hôte à utiliser dans le certificat SSL.

source: It will become the 'commonName' field of the generated SSL certificate.
fr: Ce sera le contenu du champ « commonName » du certificat SSL créé.

source: Alternative name(s):
fr: Nom(s) supplémentaire(s) :

source: Please enter any additional names to use in the SSL certificate.
fr: Veuillez indiquer d'éventuels noms d'hôte supplémentaires à utiliser dans le certificat SSL.

source: It will become the 'subjectAltName' field of the generated SSL certificate.
fr: Ce sera le contenu du champ « subjectAltName » du certificat SSL créé.

source: Multiple alternative names should be delimited with comma and no spaces. For a web server with multiple DNS names this could look like:
fr: Des entrées multiples doivent être délimitées par des virgules, sans espaces. Ainsi, pour un serveur web qui utilise plusieurs noms DNS, cette entrée devrait ressembler à :

source: A more complex example including a hostname, a WebID, an email address, and an IPv4 address:
fr: Exemple plus complexe comportant un nom d'hôte, un identifiant web (« WebID »), une adresse électronique et une adresse IPv4 :

source: Configure an SSL Certificate.
fr: Configuration d'un certificat SSL

source: Local SSL certificates must be replaced
fr: Remplacement indispensable des certificats SSL locaux

source: A security certificate which was automatically created for your local system needs to be replaced due to a flaw which renders it insecure. This will be done automatically.
fr: Un certificat créé précédemment pour ce système doit être remplacé en raison d'un défaut de sécurité qui le rend vulnérable. Cette opération sera automatique.

source: If you don't know anything about this, you can safely ignore this message.
fr: Vous pouvez ignorer ce message si vous ne savez pas ce dont il est question.
